# PhaseDemolished Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhaseDemolished Property
ParameterTypeId Class See Also
---
"Phase Demolished"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhaseDemolished { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhaseDemolished As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhaseDemolished {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace